; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-8-8-10)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	driver8 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-4 - location
	p1-0 - location
	p2-1 - location
	p3-0 - location
	p3-5 - location
	p4-3 - location
	p5-0 - location
	p5-1 - location
	p5-2 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s2)
	(at driver3 s5)
	(at driver4 s5)
	(at driver5 s0)
	(at driver6 s3)
	(at driver7 s2)
	(at driver8 s5)
	(at truck1 s5)
	(empty truck1)
	(at truck2 s5)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s1)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at truck6 s4)
	(empty truck6)
	(at truck7 s4)
	(empty truck7)
	(at truck8 s2)
	(empty truck8)
	(at package1 s3)
	(at package2 s0)
	(at package3 s3)
	(at package4 s1)
	(at package5 s5)
	(at package6 s2)
	(at package7 s4)
	(at package8 s4)
	(at package9 s0)
	(at package10 s3)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s0 s5)
	(link s5 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s5)
	(link s5 s1)
	(link s2 s3)
	(link s3 s2)
	(link s2 s5)
	(link s5 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s1)
	(link s1 s3)
	(link s4 s0)
	(link s0 s4)
	(link s4 s3)
	(link s3 s4)
	(link s5 s3)
	(link s3 s5)
	(link s5 s4)
	(link s4 s5)
)
	(:goal (and
	(at driver3 s2)
	(at driver5 s0)
	(at driver7 s0)
	(at driver8 s3)
	(at truck1 s0)
	(at truck2 s2)
	(at truck3 s4)
	(at truck4 s0)
	(at truck5 s0)
	(at truck6 s0)
	(at truck7 s0)
	(at truck8 s3)
	(at package1 s0)
	(at package2 s5)
	(at package3 s5)
	(at package4 s4)
	(at package5 s5)
	(at package6 s1)
	(at package7 s4)
	(at package8 s3)
	(at package9 s2)
	(at package10 s4)
	))


)

; plan
1. (board-truck driver1 s1 truck3)
   deleted: (at driver1 s1) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 3 of 22
2. (drive-truck driver1 s1 s0 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   goals met: 3 of 22
3. (drive-truck driver1 s0 s3 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   goals met: 3 of 22
4. (board-truck driver3 s5 truck1)
   deleted: (at driver3 s5) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 3 of 22
5. (drive-truck driver1 s3 s4 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   goals met: 4 of 22
6. (disembark-truck driver1 s4 truck3)
   deleted: (driving driver1 truck3)
   added: (at driver1 s4) (empty truck3)
   goals met: 4 of 22
7. (board-truck driver1 s4 truck6)
   deleted: (at driver1 s4) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 4 of 22
8. (drive-truck driver1 s4 s0 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s0)
   goals met: 5 of 22
9. (board-truck driver8 s5 truck2)
   deleted: (at driver8 s5) (empty truck2)
   added: (driving driver8 truck2)
   goals met: 5 of 22
10. (board-truck driver7 s2 truck5)
   deleted: (at driver7 s2) (empty truck5)
   added: (driving driver7 truck5)
   goals met: 5 of 22
11. (board-truck driver2 s2 truck8)
   deleted: (at driver2 s2) (empty truck8)
   added: (driving driver2 truck8)
   goals met: 5 of 22
12. (drive-truck driver2 s2 s3 truck8)
   deleted: (at truck8 s2)
   added: (at truck8 s3)
   goals met: 6 of 22
13. (drive-truck driver3 s5 s0 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   goals met: 7 of 22
14. (drive-truck driver1 s0 s1 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s1)
   goals met: 6 of 22
15. (load-truck s0 package9 truck1)
   deleted: (at package9 s0)
   added: (in package9 truck1)
   goals met: 6 of 22
16. (load-truck s0 package2 truck1)
   deleted: (at package2 s0)
   added: (in package2 truck1)
   goals met: 6 of 22
17. (drive-truck driver3 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 5 of 22
18. (unload-truck s2 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s2)
   goals met: 6 of 22
19. (drive-truck driver8 s5 s2 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s2)
   goals met: 7 of 22
20. (walk driver6 s3 p4-3)
   deleted: (at driver6 s3)
   added: (at driver6 p4-3)
   goals met: 7 of 22
21. (walk driver6 p4-3 s4)
   deleted: (at driver6 p4-3)
   added: (at driver6 s4)
   goals met: 7 of 22
22. (board-truck driver6 s4 truck7)
   deleted: (at driver6 s4) (empty truck7)
   added: (driving driver6 truck7)
   goals met: 7 of 22
23. (drive-truck driver7 s2 s0 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   goals met: 8 of 22
24. (load-truck s2 package6 truck1)
   deleted: (at package6 s2)
   added: (in package6 truck1)
   goals met: 8 of 22
25. (disembark-truck driver7 s0 truck5)
   deleted: (driving driver7 truck5)
   added: (at driver7 s0) (empty truck5)
   goals met: 9 of 22
26. (load-truck s1 package4 truck6)
   deleted: (at package4 s1)
   added: (in package4 truck6)
   goals met: 9 of 22
27. (drive-truck driver1 s1 s0 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s0)
   goals met: 10 of 22
28. (drive-truck driver3 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 10 of 22
29. (unload-truck s1 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s1)
   goals met: 11 of 22
30. (load-truck s4 package8 truck7)
   deleted: (at package8 s4)
   added: (in package8 truck7)
   goals met: 11 of 22
31. (drive-truck driver6 s4 s0 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s0)
   goals met: 12 of 22
32. (load-truck s3 package3 truck8)
   deleted: (at package3 s3)
   added: (in package3 truck8)
   goals met: 12 of 22
33. (load-truck s3 package10 truck8)
   deleted: (at package10 s3)
   added: (in package10 truck8)
   goals met: 12 of 22
34. (load-truck s3 package1 truck8)
   deleted: (at package1 s3)
   added: (in package1 truck8)
   goals met: 12 of 22
35. (drive-truck driver1 s0 s4 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s4)
   goals met: 11 of 22
36. (unload-truck s4 package4 truck6)
   deleted: (in package4 truck6)
   added: (at package4 s4)
   goals met: 12 of 22
37. (drive-truck driver1 s4 s0 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s0)
   goals met: 13 of 22
38. (drive-truck driver2 s3 s0 truck8)
   deleted: (at truck8 s3)
   added: (at truck8 s0)
   goals met: 12 of 22
39. (unload-truck s0 package1 truck8)
   deleted: (in package1 truck8)
   added: (at package1 s0)
   goals met: 13 of 22
40. (drive-truck driver2 s0 s3 truck8)
   deleted: (at truck8 s0)
   added: (at truck8 s3)
   goals met: 14 of 22
41. (drive-truck driver2 s3 s4 truck8)
   deleted: (at truck8 s3)
   added: (at truck8 s4)
   goals met: 13 of 22
42. (unload-truck s4 package10 truck8)
   deleted: (in package10 truck8)
   added: (at package10 s4)
   goals met: 14 of 22
43. (drive-truck driver2 s4 s3 truck8)
   deleted: (at truck8 s4)
   added: (at truck8 s3)
   goals met: 15 of 22
44. (drive-truck driver2 s3 s5 truck8)
   deleted: (at truck8 s3)
   added: (at truck8 s5)
   goals met: 14 of 22
45. (unload-truck s5 package3 truck8)
   deleted: (in package3 truck8)
   added: (at package3 s5)
   goals met: 15 of 22
46. (drive-truck driver2 s5 s3 truck8)
   deleted: (at truck8 s5)
   added: (at truck8 s3)
   goals met: 16 of 22
47. (drive-truck driver6 s0 s3 truck7)
   deleted: (at truck7 s0)
   added: (at truck7 s3)
   goals met: 15 of 22
48. (unload-truck s3 package8 truck7)
   deleted: (in package8 truck7)
   added: (at package8 s3)
   goals met: 16 of 22
49. (drive-truck driver6 s3 s0 truck7)
   deleted: (at truck7 s3)
   added: (at truck7 s0)
   goals met: 17 of 22
50. (drive-truck driver3 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 17 of 22
51. (unload-truck s5 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s5)
   goals met: 18 of 22
52. (drive-truck driver3 s5 s0 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   goals met: 19 of 22
53. (drive-truck driver8 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 18 of 22
54. (drive-truck driver8 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 18 of 22
55. (disembark-truck driver8 s1 truck2)
   deleted: (driving driver8 truck2)
   added: (at driver8 s1) (empty truck2)
   goals met: 18 of 22
56. (board-truck driver8 s1 truck4)
   deleted: (at driver8 s1) (empty truck4)
   added: (driving driver8 truck4)
   goals met: 18 of 22
57. (drive-truck driver3 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 17 of 22
58. (drive-truck driver8 s1 s0 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   goals met: 18 of 22
59. (drive-truck driver3 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 18 of 22
60. (disembark-truck driver3 s1 truck1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s1) (empty truck1)
   goals met: 18 of 22
61. (walk driver3 s1 p2-1)
   deleted: (at driver3 s1)
   added: (at driver3 p2-1)
   goals met: 18 of 22
62. (walk driver3 p2-1 s2)
   deleted: (at driver3 p2-1)
   added: (at driver3 s2)
   goals met: 19 of 22
63. (walk driver7 s0 p1-0)
   deleted: (at driver7 s0)
   added: (at driver7 p1-0)
   goals met: 18 of 22
64. (walk driver7 p1-0 s1)
   deleted: (at driver7 p1-0)
   added: (at driver7 s1)
   goals met: 18 of 22
65. (board-truck driver7 s1 truck2)
   deleted: (at driver7 s1) (empty truck2)
   added: (driving driver7 truck2)
   goals met: 18 of 22
66. (drive-truck driver7 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 18 of 22
67. (disembark-truck driver7 s0 truck2)
   deleted: (driving driver7 truck2)
   added: (at driver7 s0) (empty truck2)
   goals met: 19 of 22
68. (drive-truck driver8 s0 s3 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   goals met: 18 of 22
69. (disembark-truck driver8 s3 truck4)
   deleted: (driving driver8 truck4)
   added: (at driver8 s3) (empty truck4)
   goals met: 19 of 22
70. (walk driver7 s0 p1-0)
   deleted: (at driver7 s0)
   added: (at driver7 p1-0)
   goals met: 18 of 22
71. (board-truck driver5 s0 truck2)
   deleted: (at driver5 s0) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 17 of 22
72. (drive-truck driver5 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 18 of 22
73. (walk driver7 p1-0 s0)
   deleted: (at driver7 p1-0)
   added: (at driver7 s0)
   goals met: 19 of 22
74. (drive-truck driver1 s0 s1 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s1)
   goals met: 18 of 22
75. (disembark-truck driver1 s1 truck6)
   deleted: (driving driver1 truck6)
   added: (at driver1 s1) (empty truck6)
   goals met: 18 of 22
76. (board-truck driver1 s1 truck1)
   deleted: (at driver1 s1) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 18 of 22
77. (drive-truck driver1 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 19 of 22
78. (drive-truck driver5 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 18 of 22
79. (drive-truck driver5 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 18 of 22
80. (disembark-truck driver5 s1 truck2)
   deleted: (driving driver5 truck2)
   added: (at driver5 s1) (empty truck2)
   goals met: 18 of 22
81. (board-truck driver5 s1 truck6)
   deleted: (at driver5 s1) (empty truck6)
   added: (driving driver5 truck6)
   goals met: 18 of 22
82. (drive-truck driver5 s1 s0 truck6)
   deleted: (at truck6 s1)
   added: (at truck6 s0)
   goals met: 19 of 22
83. (drive-truck driver2 s3 s1 truck8)
   deleted: (at truck8 s3)
   added: (at truck8 s1)
   goals met: 18 of 22
84. (disembark-truck driver5 s0 truck6)
   deleted: (driving driver5 truck6)
   added: (at driver5 s0) (empty truck6)
   goals met: 19 of 22
85. (disembark-truck driver2 s1 truck8)
   deleted: (driving driver2 truck8)
   added: (at driver2 s1) (empty truck8)
   goals met: 19 of 22
86. (board-truck driver2 s1 truck2)
   deleted: (at driver2 s1) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 19 of 22
87. (drive-truck driver2 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 20 of 22
88. (board-truck driver8 s3 truck4)
   deleted: (at driver8 s3) (empty truck4)
   added: (driving driver8 truck4)
   goals met: 19 of 22
89. (drive-truck driver8 s3 s1 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s1)
   goals met: 19 of 22
90. (disembark-truck driver8 s1 truck4)
   deleted: (driving driver8 truck4)
   added: (at driver8 s1) (empty truck4)
   goals met: 19 of 22
91. (board-truck driver8 s1 truck8)
   deleted: (at driver8 s1) (empty truck8)
   added: (driving driver8 truck8)
   goals met: 19 of 22
92. (drive-truck driver8 s1 s3 truck8)
   deleted: (at truck8 s1)
   added: (at truck8 s3)
   goals met: 20 of 22
93. (disembark-truck driver8 s3 truck8)
   deleted: (driving driver8 truck8)
   added: (at driver8 s3) (empty truck8)
   goals met: 21 of 22
94. (walk driver7 s0 p1-0)
   deleted: (at driver7 s0)
   added: (at driver7 p1-0)
   goals met: 20 of 22
95. (walk driver7 p1-0 s1)
   deleted: (at driver7 p1-0)
   added: (at driver7 s1)
   goals met: 20 of 22
96. (board-truck driver7 s1 truck4)
   deleted: (at driver7 s1) (empty truck4)
   added: (driving driver7 truck4)
   goals met: 20 of 22
97. (drive-truck driver7 s1 s0 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   goals met: 21 of 22
98. (disembark-truck driver7 s0 truck4)
   deleted: (driving driver7 truck4)
   added: (at driver7 s0) (empty truck4)
   goals met: 22 of 22
